Австралия/src/Catalogs/ReportsOptions/ReportsOptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ReportsOptions</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>VisibleByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultVisibilityOverridden</name>
    <comment>If True, use the predefined report option's DefaultVisibility value instead of DefaultVisibility.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InteractiveSetDeletionMark</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VariantKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Keywords</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FilterParameterDescriptions</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldDescriptions</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Settings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Details</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Report</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
      <types>String</types>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
      <types>CatalogRef.MetadataObjectIDs</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Custom</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PredefinedVariant</name>
    <comment>The option defined in the configuration.</comment>
    <type>
      <types>CatalogRef.PredefinedExtensionsReportsOptions</types>
      <types>CatalogRef.PredefinedReportsOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>ReportType</name>
    <type>
      <types>EnumRef.ReportTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AvailableToAuthorOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteObjectKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeleteObjectPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SettingsHash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Placement</name>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Subsystem</name>
      <type>
        <types>CatalogRef.ExtensionObjectIDs</types>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
    <attributes>
      <name>Important</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SeeAlso</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletePredefined</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DeleteName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DeleteSubsystem</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>MultilingualValuesReports</name>
    <attributes>
      <name>LanguageKey</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Definition</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DeleteQuickAccessExceptions</name>
    <attributes>
      <name>DeleteUser</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/ReportTypes/ReportTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ReportTypes</name>
  <enumValues>
    <name>Internal</name>
  </enumValues>
  <enumValues>
    <name>Additional</name>
  </enumValues>
  <enumValues>
    <name>Extension</name>
  </enumValues>
  <enumValues>
    <name>External</name>
  </enumValues>
  <enumValues>
    <name>DeleteReport</name>
  </enumValues>
  <enumValues>
    <name>DeleteUserReport</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/ReportsOptions/Forms/ItemForm/Module.bsl
#Region EventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SetConditionalAppearance();
	If Parameters.Property("AutoTest") Then 
		Return;
	EndIf;
	If Parameters.Property("ReportFormOpeningParameters", ReportFormOpeningParameters) Then
		Return;
	EndIf;
	
	InfobaseUpdate.CheckObjectProcessed(Object, ThisObject);
	
	Available = ?(Object.AvailableToAuthorOnly, "1", "2");
	
	// Read properties of a predefined object;
	// Fill in attributes linked to a predefined object upon opening.
	ReadPredefinedObjectProperties(True);
	
	FullRightsToOptions = ReportsOptions.FullRightsToOptions();
	RightToThisOption = FullRightsToOptions Or Object.Author = Users.AuthorizedUser();
	If Not RightToThisOption Then
		ReadOnly = True;
		Items.SubsystemsTree.ReadOnly = True;
	EndIf;
	
	If Object.DeletionMark Then
		Items.SubsystemsTree.ReadOnly = True;
	EndIf;
	
	If Not Object.Custom Then
		Items.Description.ReadOnly = True;
		Items.Available.ReadOnly = True;
		Items.Author.ReadOnly = True;
		Items.Author.AutoMarkIncomplete = False;
	EndIf;
	
	IsExternal = (Object.ReportType = Enums.ReportTypes.External);
	If IsExternal Then
		Items.SubsystemsTree.ReadOnly = True;
	EndIf;
	
	Items.Available.ReadOnly = Not FullRightsToOptions;
	Items.Author.ReadOnly = Not FullRightsToOptions;
	Items.VisibleByDefault.ReadOnly = Not FullRightsToOptions;
	Items.TechnicalInformation.Visible = FullRightsToOptions;
	
	// Fill in a report name for the "View" command.
	If Object.ReportType = Enums.ReportTypes.Internal
		Or Object.ReportType = Enums.ReportTypes.Extension Then
		ReportName = Object.Report.Name;
	ElsIf Object.ReportType = Enums.ReportTypes.Additional Then
		ReportName = Object.Report.ObjectName;
	Else
		ReportName = Object.Report;
	EndIf;
	
	RefillTree(False);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	If ReportFormOpeningParameters <> Undefined Then
		Cancel = True;
		ReportsOptionsClient.OpenReportForm(Undefined, ReportFormOpeningParameters);
	EndIf;
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If Source <> ThisObject
		AND (EventName = ReportsOptionsClientServer.EventNameChangingOption()
			Or EventName = "Write_ConstantsSet") Then
		RefillTree(True);
		Items.SubsystemsTree.Expand(SubsystemsTree.GetItems()[0].GetID(), True);
	EndIf;
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	// Write properties linked to a predefined report option.
	If TypeOf(PredefinedOptionProperties) = Type("FixedStructure") Then
		CurrentObject.DefaultVisibilityOverridden = 
			Object.VisibleByDefault <> PredefinedOptionProperties.VisibleByDefault;
		
		If Not IsBlankString(Object.Details) AND Lower(TrimAll(Object.Details)) = Lower(TrimAll(PredefinedOptionProperties.Details)) Then
			CurrentObject.Details = "";
		EndIf;
	EndIf;
	
	// Write a subsystems tree.
	DestinationTree = FormAttributeToValue("SubsystemsTree", Type("ValueTree"));
	If CurrentObject.IsNew() Then
		ChangedSections = DestinationTree.Rows.FindRows(New Structure("Use", 1), True);
	Else
		ChangedSections = DestinationTree.Rows.FindRows(New Structure("Modified", True), True);
	EndIf;
	ReportsOptions.SubsystemsTreeWrite(CurrentObject, ChangedSections);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	RefillTree(False);
	ReadPredefinedObjectProperties(False);
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	NotificationParameter = New Structure("Ref, Description, Author, Details");
	FillPropertyValues(NotificationParameter, Object);
	Notify(ReportsOptionsClientServer.EventNameChangingOption(), NotificationParameter, ThisObject);
	StandardSubsystemsClient.ExpandTreeNodes(ThisObject, "SubsystemsTree", "*", True);
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	// StandardSubsystems.AccessManagement
	If Common.SubsystemExists("StandardSubsystems.AccessManagement") Then
		ModuleAccessManagement = Common.CommonModule("AccessManagement");
		ModuleAccessManagement.OnReadAtServer(ThisObject, CurrentObject);
	EndIf;
	// End StandardSubsystems.AccessManagement

EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure DescriptionStartChoice(Item, ChoiceData, StandardProcessing)
	StandardProcessing = False;
	ReportsOptionsClient.EditMultilineText(ThisObject, Item.EditText, Object, "Details", NStr("ru = 'Описание'; en = 'Details'; pl = 'Szczegóły';es_ES = 'Detalles';es_CO = 'Detalles';tr = 'Ayrıntılar';it = 'Dettagli';de = 'Details'"));
EndProcedure

&AtClient
Procedure AvailableOnChange(Item)
	Object.AvailableToAuthorOnly = (ThisObject.Available = "1");
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersSubsystemsTree

&AtClient
Procedure SubsystemsTreeUsingOnChange(Item)
	ReportsOptionsClient.SubsystemsTreeUsingOnChange(ThisObject, Item);
EndProcedure

&AtClient
Procedure SubsystemsTreeImportanceOnChange(Item)
	ReportsOptionsClient.SubsystemsTreeImportanceOnChange(ThisObject, Item);
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetConditionalAppearance()
	
	ConditionalAppearance.Items.Clear();
	ReportsOptions.SetSubsystemsTreeConditionalAppearance(ThisObject);
	
EndProcedure

&AtServer
Function RefillTree(Read)
	SelectedRows = ReportsServer.RememberSelectedRows(ThisObject, "SubsystemsTree", "Ref");
	If Read Then
		ThisObject.Read();
	EndIf;
	DestinationTree = ReportsOptions.SubsystemsTreeGenerate(ThisObject, Object);
	ValueToFormAttribute(DestinationTree, "SubsystemsTree");
	ReportsServer.RestoreSelectedRows(ThisObject, "SubsystemsTree", SelectedRows);
	Return True;
EndFunction

&AtServer
Procedure ReadPredefinedObjectProperties(FirstReading)
	If FirstReading Then
		If Not Object.Custom
			AND (Object.ReportType = Enums.ReportTypes.Internal
				Or Object.ReportType = Enums.ReportTypes.Extension)
			AND ValueIsFilled(Object.PredefinedVariant) Then // Read settings of a predefined object.
			Information = Common.ObjectAttributesValues(Object.PredefinedVariant, "VisibleByDefault, Details");
			PredefinedOptionProperties = New FixedStructure(Information);
		Else
			Return; // Not a predefined object.
		EndIf;
	Else
		If TypeOf(PredefinedOptionProperties) <> Type("FixedStructure") Then
			Return; // Not a predefined object.
		EndIf;
	EndIf;
	
	If Object.DefaultVisibilityOverridden = False Then
		Object.VisibleByDefault = PredefinedOptionProperties.VisibleByDefault;
	EndIf;
	
	If IsBlankString(Object.Details) Then
		Object.Details = PredefinedOptionProperties.Details;
	EndIf;
EndProcedure

#EndRegion
